#!/usr/bin/python3

"""
Выполнить логические побитовые операции "И", "ИЛИ" и др. над числами 5 и 6. Выполнить над числом 5 побитовый сдвиг
вправо и влево на два знака.

"""

print("Дано a = 5; b = 6")
print()
a = 5
b = 6

print("Логическое побитовое a 'И' b:", a & b)
print("Так как: b'%s' 'И' b'%s' = b'%s'" % (str(bin(a))[2:], str(bin(b))[2:], str(bin(a & b))[2:]))
print()

print("Логическое побитовое a 'ИЛИ' b", a | b)
print("Так как: b'%s' 'ИЛИ' b'%s' = b'%s'" % (str(bin(a))[2:], str(bin(b))[2:], str(bin(a | b))[2:]))
print()

print("Побитовый сдвиг a влево на два знака:", a << 2)
print("Так как: b'%s' << 2 = b'%s'" % (str(bin(a))[2:], str(bin(a << 2))[2:]))
print()

print("Побитовый сдвиг a вправо на два знака:", a >> 2)
print("Так как: b'%s' >> 2 = b'%s'" % (str(bin(a))[2:], str(bin(a >> 2))[2:]))
